Revit 2026 API

# FamilyItemFactoryNewReferencePoint(PointElementReference) Method

---

Create a reference point on an existing reference in an Autodesk Revit family document.

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferencePoint NewReferencePoint(
	PointElementReference A_0
)
```
```vb
Public Function NewReferencePoint (
	A_0 As PointElementReference
) As ReferencePoint
```
```cpp
public:
ReferencePoint^ NewReferencePoint(
	PointElementReference^ A_0
)
```
```fsharp
member NewReferencePoint :
        A_0 : PointElementReference -> ReferencePoint
```

#### Parameters

A_0 PointElementReference

#### Return Value

ReferencePointThe newly created ReferencePoint.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the argument is . |
| InvalidOperationException | Thrown when the family is not a Conceptual Mass Family. |

The location and coordinate system of the point is determined by the particular PointReference subclass, and the point will remain constrained to that reference.

#### Reference

FamilyItemFactory Class

NewReferencePoint Overload

Autodesk.Revit.Creation Namespace